cloud.org
#+TITLE: emacs-based secure cloud storage for text files
#+AUTHOR: Oleg Shalaev
#+EMAIL:  oleg@chalaev.com
#+LaTeX_HEADER: \usepackage[english,russian]{babel}
#+LATEX_HEADER: \usepackage[letterpaper,hmargin={1.5cm,1.5cm},vmargin={1.3cm,2cm},nohead,nofoot]{geometry}

Uses ~macros.el~, ~functions.el~, and ~logging.el~ from the [[https://notabug.org/shalaev/elisp-goodies][elisp-goodies]] project.

Github vs Emacs: since ~github~
1. does not understand ~org-mode~ internal links,
2. does not show calculation results from ~org~ files and
3. can not hide selected sections (thus making the web page too long),
consider opening this file in ~emacs~ instead of watching it online.

* Symmetric (en/de)cryption
All hosts (computers) are treated identically – there is no "main" host. This is why we use symmetric encryption
with automatically generated password. 
For (en/de)cryption, emacs will call shell commands similar to
#+BEGIN_SRC shell
gpg --pinentry-mode loopback --passphrase "somepass" -o /mnt/cloud/abc.gpg --symmetric ~/myFile.txt
gpg --pinentry-mode loopback --passphrase "somepass" -o ~/myFile.txt --decrypt /mnt/cloud/abc.gpg
#+END_SRC

* Initialization
[[https://stallman.org/][Stallman]] recommends not to use  ~CL~, but for now I am still requiring it.
** Local configuration
*** variables (configuration parameters)
The variables with the names starting with "cloud-" should probably be kept global; the others will be "localized".

=cloud-file-hooks= is used for special files (e.g., diary or bookmarks);
When those are copied from the cloud to the local hard drive, one should call, e.g., =diary-view-entries= or =bookmark-load=:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el :shebang ";;; -*- mode: Emacs-Lisp;  lexical-binding: t; -*-"
;; generated from cloud.org
(defvar password nil); to be read from config or generated
(defvar N-CPU-cores 1)
(defvar cloud-file-hooks nil "for special files treatment")
#+END_SRC
← for example, after we have updated local ~emacs-diary~ file from the cloud, we may want to re-scan it.

#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defvar upload-queue nil "names of edited files")
(defvar added-files nil "newly clouded files")
#+END_SRC

From time to time (e.g., when we =M-x cloud-sync=)  we synchronize local information
with the remote file whose (secret) name is stored in =remote/files=:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defvar remote/files nil "encrypted DB (without .gpg suffix) stored on the server")
(defvar remote-dir  "/mnt/cloud/")
(defun remote/files() remote/files)
(defun remote-dir() remote-dir)
(defun remote-files() (concat (remote-dir) remote/files ".gpg"))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defvar emacs-d "~/.emacs.d/")
(defvar cloud-was-connected t "normally t, nill when there was no connection")
#+END_SRC
← ~cloud-was-connected~ is set to ~nil~ when ~(cloud-sync)~ fails, and is set to ~t~ once =(read-fileDB)= succeeds.

Similarly to how they do it in ~JavaScript~, let me call the following functions "dynamic variables":
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun local-dir() (concat emacs-d "cloud/"))
(defun cloud-mk() (concat (local-dir) "cloud.mk"))
(defun lock-dir() (concat (remote-dir) "now-syncing/"))
(defun lock-file() (concat (lock-dir) (system-name)))
(defun image-passes() (concat (local-dir) "individual.passes"))
(defun local/() (concat (local-dir) (system-name) "/"))
(defun local/log() (concat (local/) "log"))
#+END_SRC

Instead of storing configuration in =~/.emacs= I prefer to store it in a separate file:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun local/config() (concat (local-dir) (system-name) "/config"))
#+END_SRC
This is because
1. sometimes the code will update its configuration, and
2. in this way configuration data is more separated from other ~elisp~ programs.

*** creating (only once, during the first run)
Before we start for the very first time, when cloud directory is inexistent or empty, 
we create the password for encryption by =(cloud-init)=:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun cloud-init() "initializes cloud directory and generates password -- runs only once"
(clog :info "atempting to create new configuration for this host")
;;(when (yes-or-no-p "Is cloud mounted?")
;;(setf remote-dir (read-string "cloud directory=" remote-dir))
(ifn (member (safe-mkdir remote-dir) '(:exists t))
(clog :error "could not create/access directory %s" remote-dir)
#+END_SRC
For safety reasons refusing to initialize a directory already containing encrypted files:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(if (directory-files remote-dir nil "^.\+.gpg$" t)
    (clog :error "please clean the directory %s before asking me to initialize it" remote-dir)
(clog :info "creating (main) remote file DB in unused directory %s" remote-dir)
(ifn-set ((remote/files (new-file-name remote-dir)))
  (clog :error "could not create DB file in the directory %s" remote-dir)
#+END_SRC
Generating random password and saving it in the local configuration file:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(setf password (rand-str 9))
#+END_SRC
– one password for all text files – 
for now this software is designed for single person only, and I do not see why should I use individual passwords for different
text files. Note that I already use individual passwords for images so (from the technical point of view) it is easy to use
individuall passwords for some (or all) text files ← might facilitate gradual password replacement.

The concept "one password for many text files" might be changed later if I ever upgrade the code for sharing files within a group of people;
but if this happens, I will probably have to abandon symmetric encryption and deal with public/private keys.
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(ifn (member (safe-mkdir (local-dir)) '(:exists t))
  (clog :error "could not create/acess directory %s" (local-dir))
(write-conf)
(clog :info "use M-x cloud-add in the dired to cloud important files and directories" ))))))
#+END_SRC

*** reading and writing
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun write-conf()
(clog :debug "starting write-conf")
(with-temp-file (local/config)
  (insert (format "remote/files=%s" (remote/files))) (newline)
  (insert (format "password=%s" password)) (newline)
  (insert (format "number-of-CPU-cores=%s" N-CPU-cores)) (newline)
  (insert (format "remote-directory=%s" remote-dir)) (newline)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun read-conf()
  "reads configuration file"
(let (conf)
(needs-set
  ((conf (read-conf* (local/config)))
   (remote/files (cdr (assoc "remote/files" conf)) (clog :error "specify 3-symbol contents name \"remote/files\" in %s" (local/config)))
   (N-CPU-cores (string-to-number
 (or
 (cdr (assoc "number-of-CPU-cores" conf))
 (clog :warning "specify number-of-CPU-cores in %s" (local/config)
 "1"))))
   (password (cdr (assoc "password" conf)) (clog :error "specify password in %s" (local/config)))
   (remote-dir (cdr (assoc "remote-directory" conf)) (clog :error "specify remote-directory in %s" (local/config))))
conf)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun read-conf* (file-name)
  "reads configuration file"
(with-temp-buffer
(safe-insert-file (local/config))
  (let (res str)
    (while (< 0 (length (setf str (read-line))))
     (if (string-match "^\\(\\ca+\\)=\\(\\ca+\\)$" str)
	 (push (cons (match-string 1 str) (match-string 2 str)) res)
       (clog :error "garbage string in configuration file: %s" str)))
    res)))
#+END_SRC

** Host/Action/File information
*** general
We got three variables (or databases) describing
1. host names participating in file synchronization,
2. actions to be performed on other hosts, and
3. names of the clouded files:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defvar cloud-hosts nil "host names participating in file synchronization")
(defvar remote-actions nil "actions to be saved in the cloud")
(defvar file-DB nil "list of vectors, each corresponding to a clouded file")
#+END_SRC
← The content of these variables is stored
1. in RAM: (=cloud-hosts=, =remote-actions=, =file-DB=),
2. in local file named =(local/all)=
3. on the server, in a file named =remote/files=.

Every element of ~file-DB~ is a vector having the following structure:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defvar file-fields; indices numerating array fields
(list 'plain; original (local) file name
'cipher; encrypted file name (base name)
'mtime; modification time
'modes; permissions
'uname; user name (obsolete and unused)
'gname)); group name
(let ((i 0)) (dolist (field-name file-fields) (setf i (1+ (set field-name i)))))
#+END_SRC

*** hosts and actions
The content of ~file-DB~ is locally stored in the file named =(local/all)=:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun local/all() (concat (local/) "all"))
#+END_SRC

*** printing
**** hosts
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun print-hosts()
(dolist (hostname cloud-hosts) (insert (format "%s " hostname)))
(backspace)
(newline))
;;(clog :debug "print-hosts finished"))
#+END_SRC
**** actions
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun print-actions()
(clog :debug "print-action started")
(dolist (action (reverse remote-actions))
  (insert (format-action action))
  (drop remote-actions action)
  ;;(backspace) 
(newline)))
#+END_SRC
**** file info
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun format-file (DB-rec)
  (format "%S %s %s %s %d %S"
	  (tilda (aref DB-rec plain))
	  (aref DB-rec cipher)
	  (aref DB-rec uname)
	  (aref DB-rec gname)
	  (aref DB-rec modes); integer
	  (format-time-string "%F %H:%M:%S %Z" (aref DB-rec mtime))))
#+END_SRC

*** parsing
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun safe-FL()
  (if (< (line-end-position) (point-max))
     (forward-line)
     (move-end-of-line 1)))
(defun read-line()
(let ((str (buffer-substring-no-properties (line-beginning-position) (line-end-position))))
 (safe-FL)
 str))
(defun cut-line() 
(let ((str (buffer-substring-no-properties (line-beginning-position) (line-end-position))))
  (delete-region (line-beginning-position) (progn (safe-FL) (point)))
   str))
#+END_SRC

