generated/main.el
;;; -*- mode: Emacs-Lisp;  lexical-binding: t; -*-
;; generated from cloud.org
(defvar password nil); to be read from config or generated
(defvar N-CPU-cores 1)
(defvar cloud-file-hooks nil "for special files treatment")

(defvar upload-queue nil "names of edited files")
(defvar added-files nil "newly clouded files")

(defvar remote/files nil "encrypted DB (without .gpg suffix) stored on the server")
(defvar remote-dir  "/mnt/cloud/")
(defun remote/files() remote/files)
(defun remote-dir() remote-dir)
(defun remote-files() (concat (remote-dir) remote/files ".gpg"))

(defvar emacs-d "~/.emacs.d/")
(defvar cloud-was-connected t "normally t, nill when there was no connection")

(defun local-dir() (concat emacs-d "cloud/"))
(defun cloud-mk() (concat (local-dir) "cloud.mk"))
(defun lock-dir() (concat (remote-dir) "now-syncing/"))
(defun lock-file() (concat (lock-dir) (system-name)))
(defun image-passes() (concat (local-dir) "individual.passes"))
(defun local/() (concat (local-dir) (system-name) "/"))
(defun local/log() (concat (local/) "log"))

(defun local/config() (concat (local-dir) (system-name) "/config"))

(defun cloud-init() "initializes cloud directory and generates password -- runs only once"
(clog :info "atempting to create new configuration for this host")
;;(when (yes-or-no-p "Is cloud mounted?")
;;(setf remote-dir (read-string "cloud directory=" remote-dir))
(ifn (member (safe-mkdir remote-dir) '(:exists t))
(clog :error "could not create/access directory %s" remote-dir)

(if (directory-files remote-dir nil "^.\+.gpg$" t)
    (clog :error "please clean the directory %s before asking me to initialize it" remote-dir)
(clog :info "creating (main) remote file DB in unused directory %s" remote-dir)
(ifn-set ((remote/files (new-file-name remote-dir)))
  (clog :error "could not create DB file in the directory %s" remote-dir)

(setf password (rand-str 9))

(ifn (member (safe-mkdir (local-dir)) '(:exists t))
  (clog :error "could not create/acess directory %s" (local-dir))
(write-conf)
(clog :info "use M-x cloud-add in the dired to cloud important files and directories" ))))))

(defun write-conf()
(clog :debug "starting write-conf")
(with-temp-file (local/config)
  (insert (format "remote/files=%s" (remote/files))) (newline)
  (insert (format "password=%s" password)) (newline)
  (insert (format "number-of-CPU-cores=%s" N-CPU-cores)) (newline)
  (insert (format "remote-directory=%s" remote-dir)) (newline)))

(defun read-conf()
  "reads configuration file"
(let (conf)
(needs-set
  ((conf (read-conf* (local/config)))
   (remote/files (cdr (assoc "remote/files" conf)) (clog :error "specify 3-symbol contents name \"remote/files\" in %s" (local/config)))
   (N-CPU-cores (string-to-number
 (or
 (cdr (assoc "number-of-CPU-cores" conf))
 (clog :warning "specify number-of-CPU-cores in %s" (local/config)
 "1"))))
   (password (cdr (assoc "password" conf)) (clog :error "specify password in %s" (local/config)))
   (remote-dir (cdr (assoc "remote-directory" conf)) (clog :error "specify remote-directory in %s" (local/config))))
conf)))

(defun read-conf* (file-name)
  "reads configuration file"
(with-temp-buffer
(safe-insert-file (local/config))
  (let (res str)
    (while (< 0 (length (setf str (read-line))))
     (if (string-match "^\\(\\ca+\\)=\\(\\ca+\\)$" str)
	 (push (cons (match-string 1 str) (match-string 2 str)) res)
       (clog :error "garbage string in configuration file: %s" str)))
    res)))

(defvar cloud-hosts nil "host names participating in file synchronization")
(defvar remote-actions nil "actions to be saved in the cloud")
(defvar file-DB nil "list of vectors, each corresponding to a clouded file")

(defvar file-fields; indices numerating array fields
(list 'plain; original (local) file name
'cipher; encrypted file name (base name)
'mtime; modification time
'modes; permissions
'uname; user name (obsolete and unused)
'gname)); group name
(let ((i 0)) (dolist (field-name file-fields) (setf i (1+ (set field-name i)))))

(defun local/all() (concat (local/) "all"))

(defun print-hosts()
(dolist (hostname cloud-hosts) (insert (format "%s " hostname)))
(backspace)
(newline))
;;(clog :debug "print-hosts finished"))

(defun print-actions()
(clog :debug "print-action started")
(dolist (action (reverse remote-actions))
  (insert (format-action action))
  (drop remote-actions action)
  ;;(backspace) 
(newline)))

(defun format-file (DB-rec)
  (format "%S %s %s %s %d %S"
	  (tilda (aref DB-rec plain))
	  (aref DB-rec cipher)
	  (aref DB-rec uname)
	  (aref DB-rec gname)
	  (aref DB-rec modes); integer
	  (format-time-string "%F %H:%M:%S %Z" (aref DB-rec mtime))))

(defun safe-FL()
  (if (< (line-end-position) (point-max))
     (forward-line)
     (move-end-of-line 1)))
(defun read-line()
(let ((str (buffer-substring-no-properties (line-beginning-position) (line-end-position))))
 (safe-FL)
 str))
(defun cut-line() 
(let ((str (buffer-substring-no-properties (line-beginning-position) (line-end-position))))
  (delete-region (line-beginning-position) (progn (safe-FL) (point)))
   str))
