cloud.org
**** action lines
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun parse-action(str)
(clog :debug "parse-action(%s) ..." str)
(let ((action (make-vector (length action-fields) nil)))
#+END_SRC
An action string has unknown number of fields (columns); some of them are quoted and may contain spaces, others are not.
We use =begins-with= from ~common.el~ to read the fields.

Let us parse the string =str= and save extracted parameters (values) in the vector =action=:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(dolist (column (list
                 `(:time-stamp . ,i-time)
                 `(:int . ,i-ID)
                 `(:int . ,i-Nargs)))
  (needs ((col-value (begins-with str (car column)) (bad-column "action" (cdr column))))
     (aset action (cdr column) (car col-value))
     (setf str (cdr col-value))))
#+END_SRC
=(aref action i-Nargs)= must be evaluated _after_ =`(:int . ,i-Nargs)=, but _before_ we proceed with =(cons (cons  :string  (aref action i-Nargs)) i-args)=:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(dolist (column 
(list
  (cons (cons  :string  (aref action i-Nargs)) i-args)
       `(:strings . ,i-hostnames)))
  (needs ((col-value (begins-with str (car column)) (bad-column "action" (cdr column))))
     (aset action (cdr column) (car col-value)); was (mapcar #'untilda (car col-value))
     (setf str (cdr col-value))))
#+END_SRC
So, we have just got information about pending action.
We perform it immediately if our hostname is in the list =(aref action i-hostnames)=.

In this sigle-user code action's time stamp =AID= may serve as its unique ID:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(let ((AID (format-time-string "%02m/%02d %H:%M:%S" (aref action i-time))))
(clog :info "... will later be referenced as %s" AID)
(cons AID action))))
#+END_SRC

**** file lines
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun str-to-DBrec(str)
"parses one file line from the remote file DB"
(ifn (string-match "\"\\(.+\\)\"\s+\\([^\s]+\\)\s+\\([^\s]+\\)\s+\\([^\s]+\\)\s+\\([[:digit:]]+\\)\s+\"\\(.+\\)\"" str)
(clog :error "Ignoring invalid file line %s" str)
#+END_SRC
We've got a valid string describing a clouded file, now let us parse it.
The first column is the file name:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(let ((CF (make-vector (length file-fields) nil))
      (FN (match-string 1 str)))
  (aset CF plain FN)
  (aset CF cipher (match-string 2 str))
  (aset CF uname (match-string 3 str))
#+END_SRC
← actually the last field (=uname= stands for "user name") is obsolete and no more used: it is assumed that all files are owned by the user who runs the code.
(Later I will get rid of this field or replace it with another one.)

We syncronize ~gname~ (name of the group), ~modes~ (permissions), and ~mtime~ (modification time) for every file:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
  (aset CF gname (match-string 4 str))
  (aset CF modes (string-to-number (match-string 5 str)))
  (let ((mtime-str (match-string 6 str)))
(ifn (string-match "[0-9]\\{4\\}-[0-9][0-9]-[0-9][0-9] [0-9][0-9]:[0-9][0-9]:[0-9][0-9] [[:upper:]]\\{3\\}" mtime-str)
(bad-column "file" 6 mtime-str)
(aset CF mtime (parse-time mtime-str))
CF)))))
#+END_SRC

** (En/De)cryption
Especially when ~(= 0 *log-level*)~ this code might print many log messages.
For most important ones I will use this function
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun end-log (fstr &rest args)
  "message + time"
  (push
   (apply #'format
	  (cons (concat
		 (format-time-string "%H:%M:%S " (apply 'encode-time (butlast (decode-time (current-time)) 3)))
		 fstr)
		args))
   important-msgs))
#+END_SRC
which is going to print them at the end of the syncronization session.

Some files require special treatment after they are updated on the local disk from the cloud:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun post-decrypt (FN)
  "special treatment for certain files"
  (let ((ext (file-name-extension FN))
	(name (file-name-base FN)))
    (when (string= FN (expand-file-name diary-file))
      (with-current-buffer (find-file-noselect (diary-check-diary-file))
	(clog :info "diary buffer opened or updated")))
     (when (member FN *loaded*)
       (end-log "*configuration changed, consider reloading emacs*")
    (clog :warning "consider reloading configuration file %s" FN)
    ;;   (load-file FN))
)))
#+END_SRC
where =diary-check-diary-file= will raise an error (exception) in case of inexisting diary-file.

** Other variables
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defvar removed-files  nil "files that were just removed (or renamed) on local host before (cloud-sync)")
#+END_SRC
← this variable serves to prevent recovering them from the cloud during the next =M-x cloud-sync=.
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defvar important-msgs nil "these messages will be typically printed at the end of the process")
(defvar gpg-process nil "assyncronous make-process for (en/de)cryption")
#+END_SRC

* Connection with the cloud
Checking if the internet connection is established:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun cloud-connected-p()
  (and
   (remote-dir) (remote/files)
   (file-readable-p remote-dir)))
;;(file-readable-p (remote-files)
#+END_SRC
← note that =cloud-connected-p= should *not* be called before local file has been read by =read-conf=.

** SSH
Sometimes internet connection can be unstable or shut down unexpectedly,
so I added ~reconnect~ option to the ~/etc/fstab~ entry
(this probably will not work if you have to supply password to unlock the ssh key):
#+BEGIN_SRC 
# /etc/fstab
sshfs#shalaev@leanws.com: /mnt/lws fuse reconnect,users,auto 0 0
#+END_SRC
where "shalaev" is my user name, and ~leanws.com~ is the ssh-server (replace these with your values).

To limit the timeout to 30 seconds, update =~/.ssh/config= as follows:
#+name: ssh-config
#+BEGIN_SRC
# ~/.ssh/config
ServerAliveInterval 15
ServerAliveCountMax 2
#+END_SRC

** WebDav
=WebDav= is much slower than =ssh=, but it should be ok for file synchronization.
To mount ~yandex~ or ~pcloud~ to local directories ~/mnt/yd/~ and ~/mnt/pc~ I need three files:
~/etc/fstab~, ~/etc/davfs2/davfs2.conf~, and ~/etc/davfs2/secrets~
#+BEGIN_SRC 
# /etc/fstab
https://webdav.yandex.ru        /mnt/yd	davfs   user,noauto,file_mode=0664,dir_mode=2775,x-systemd.device-timeout=20 0 0
https://webdav.pcloud.com	/mnt/pc	davfs	user,noauto,uid=shalaev,gid=shalaev,file_mode=0664,dir_mode=2775,x-systemd.device-timeout=20 0 0
#+END_SRC
where ~shalaev~ is my user name and group name; you must replace it with yours.

#+BEGIN_SRC
# /etc/davfs2/davfs2.conf
dav_user        davfs2
dav_group       davfs2
use_locks	0
cache_dir       /var/cache/davfs2 # system wide cache
cache_size      5000              # MiByte
delay_upload	0
#+END_SRC

#+BEGIN_SRC
# /etc/davfs2/secrets
/mnt/yd	myYandexLogin		password
/mnt/pc	myPCloudLogin		password
#+END_SRC

** FTP
Somehow I am not aware of /reliable/ way of mounting an ~ftp~ server to a directory in linux;
~emacs~ also seems to be bad in estsblishing ~ftp~ connections.
May be developers think that ~ftp~ is obsolete and ignore it;
personally I don't see anything wrong with it, especially when an ~ftp~ connection is established using SSL-encryption.

Probably the best way to improve FTP-support in emacs would be to write an eLisp-wrapper for [[http://lftp.yar.ru][lftp]] command.

* Remote file DB
This file stores [[Host/Action/File information][Host/Action/File information]] on the server.
** Writing
*** The first line: list of all hostnames
←  without quotes, separated by spaces.

In the following, ~DBname~ is the name of _decrypted_ remote file DB:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun write-all (DBname)
  (with-temp-file DBname
(print-hosts)
#+END_SRC
Probably I should *not* write the file if both =upload-queue= and =added-files= are nil.

The next block of lines contains information about pending [[Actions][actions]] →

*** Pending actions
In this block, every line is has the following fields (columns):
1. Time stamp,
2. (integer) action ID,
3. (integer) number of arguments for this action (one column),
4. [arguments+] (several columns),
5. hostnames, where the action has to be performed (several columns).
   Gets updated by =cloud-host-add= and =cloud-host-forget=.

The order of actions is important! For example, imagine that
I renamed or moved a file twice; the order of these actions on a remote host should be the as on the local one:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(print-actions)
#+END_SRC
Pending actions block is ended by an empty line separating it from the rest of the file:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(newline)
#+END_SRC

*** List of clouded files
This is the last (and, usually, the largest) block of lines.
Here every line corresponds to one file:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(dolist (file-record file-DB)
  (insert (format-file file-record)) (newline))
(setf removed-files nil) t))
#+END_SRC

** Parsing
*** list of host names
The function =read-all= (returns =nil=) reads (previously decrypted) [[Host/Action/File information][host/action/file information]]:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun read-all (DBname)
  "reads content (text) file into the database file-DB"
  (temp-open DBname
  (let (str)
(needs-set
 ((cloud-hosts
  (split-string (setf str (read-line)))
  (clog :error "invalid first line in the remote file DB %s" DBname)))
#+END_SRC
In case =read-all= is launched on an unknown computer
(that is, its hostname is not yet mentioned in the first line of the file =DBname=),
it is automatically added to the cloud network:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(unless (member (system-name) cloud-hosts) (cloud-host-add))
#+END_SRC

*** list of pending actions
The concept of actions is explained in the [[Actions][corresponding section]].

Keep reading one action after another until we encounter an empty line:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(while (< 0 (length (setf str (read-line))))
(when-let ((AA (parse-action str)) (AID (car AA)) (action (cdr AA)))
  (ifn (member (system-name) (aref action i-hostnames))
      (clog :info "this host is unaffected by action %s" AID)
    (if (perform action)
	(clog :info "sucessfully performed action %s" AID)
      (clog :error " action %s failed, will NOT retry it" AID))
#+END_SRC
← even if the action failed, we wash our hands and not retry it.
If the action is still pending on some hosts, we will store it in =remote-actions=
which is going later to be saved into the [[Contents file][remote file DB]]:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(when (drop (aref action i-hostnames) (system-name))
  (push action remote-actions)))))
#+END_SRC

An empty line ends the action reading loop;
the next thing to do is to read/parse the files' block of lines.

