cloud.org
*** list of (clouded) files
For files that need to be (up/down)loaded (to/from) the cloud =(read-fileDB)= forms ~cloud.mk~
which can be fed to GNU make as =make --jobs=N -f cloud.mk=, where ~jobs~ parameter ~N~ is the (configurable) number of CPU cores.
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
;;(forward-line)
(needs ((CDFs
#+END_SRC
← =CDFs= will contain the data about the files in the remote directory.

Our ~.gpg~ files are named as  ~XYZ.gpg~; the next line cuts the extension  ~.gpg~ away:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
 (mapcar #'(lambda(s) (replace-regexp-in-string "....$" "" s))
      (directory-files remote-dir nil "...\...." t)) (clog :error "can not read %s" remote-dir)))
(while (< 10 (length (setf str (read-line))))
(when-let ((CF (str-to-DBrec str)))
#+END_SRC
Ideally every file mentioned in =file-DB= should exist on a local hard disk.
In reality either file, the local one, or the remote one, or both, might be absent,
and we have to address all of these situations:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(let* ((FN (plain-name CF))
      (remote-file-exists (member FN CDFs))
      (local-file-rec (or (cloud-locate-FN FN)
(when-let ((LF (get-file-properties* FN)))
        (aset LF cipher (aref CF cipher))
        (push LF file-DB)
        LF))))
(cond
((not (or local-file-rec remote-file-exists))
 (clog :error "forgetting file %s which is marked as clouded but is neither on local disk nor in the cloud" FN)
 (drop file-DB CF))
((or
 (and (not local-file-rec) remote-file-exists)
 (and local-file-rec remote-file-exists (time< (aref local-file-rec mtime) (aref CF mtime))))
#+END_SRC
=download= queues the file for downloading from the cloud (by updating the [[Creating make file][make file]]):
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(download CF))
((or
 (and local-file-rec remote-file-exists (time< (aref CF mtime) (aref local-file-rec mtime)))
 (and local-file-rec (not remote-file-exists)))
(upload CF))))))
t)))))
#+END_SRC
← similarly, =upload= queues the file for uploading to the cloud.

At this point we ended up parsing the list of files.
=(defun read-all ...)= ends here.

* On saving files in emacs
When the file is saved in emacs (=C-x s=), we mark it so that it is going
to be uploaded to the cloud when the user calls =cloud-sync= next time:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun touch (FN)
"called when the file named FN is changed"
(clog :debug "touch(%s)" FN)
(when (and FN (stringp FN))
  (when-let ((file-data (cloud-locate-FN (file-chase-links FN))))
    (aset file-data mtime (current-time))
    (upload file-data) t)))
(defun on-current-buffer-save()
  (touch (buffer-file-name)))
(add-hook 'after-save-hook 'on-current-buffer-save)
#+END_SRC
* Creating make file
Make file is useful because
1. it allows us to use multi-threading and
2. it simplifies debugging.

When the make file is ready, we launch it with =make -jN ~/.emacs.d/cloud/cloud.mk=, where =N= is the number of CPU cores. 
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(macrolet ((NL () '(push "
" Makefile))
(inl (&rest format-pars) `(progn (push ,(cons 'format format-pars) Makefile) (NL))))
(cl-flet ((pass-d()  (concat (local-dir) "pass.d/")))
(cl-flet ((updated() (concat (pass-d) "updated")))
(let (all Makefile uploaded
#+END_SRC
(Already encrypted) gpg-files types are not supposed to be encrypted, and images should be encrypted in a special way.
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(specially-encoded '(
#+END_SRC
Already encrypted (~gpg~) files are just copied
#+END_SRC
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
("$(cloud)%s.gpg: %s
\tcp $< $@
" "gpg")
#+END_SRC
← this format string requires 2 arguments: =(aref file-record cipher)= and =(aref file-record plain)=.

Make stanza for encrypting an image is more sophisticated:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
("$(cloud)%s.png: %s %s
\tconvert $< -encipher %s%s $@
" "jpg" "jpeg" "png")))
#+END_SRC
← this format string requires 5 arguments:
=(aref file-record cipher)=, =(aref file-record plain)=, =(updated)=,
=(pass-d)=, and (once again) =(aref file-record cipher)=.

Similarly, for decoding
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(specially-decoded '(
("%s: $(cloud)%s.gpg
\tcp $< $@
" "gpg")
("%s: $(cloud)%s.png  %s
\tconvert $< -decipher %s%s $@
" "jpg" "jpeg" "png"))))
#+END_SRC
with the same number of arguments, as for encoding above.

** Creating ~make~ stanza for encoding one file
Non-standard case (an image or a ~gpg~-file):
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(cl-flet ((enc-make-stanza(file-record)
(when-let ((XYZ (aref file-record cipher)) (FN (tilda (aref file-record plain))))
(let ((file-ext (file-name-extension FN)))
(concat
(if-let ((fstr (car (find file-ext specially-encoded :key #'cdr :test #'(lambda(x y) (member x y))))))
(format fstr XYZ FN (updated) (pass-d) XYZ)
#+END_SRC
where ~XYZ~ is the (random) 3-symbol cloud name of the file (without extension).

All other files are treated with ~gpg~:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(format "$(cloud)%s.gpg: %s
\t@$(enc) $@ $<
" XYZ FN))
#+END_SRC
At the end of every file (en/de)coding stanza we send a message to the log file:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(format "\t-echo \"$(date): uploaded %s\" >> $(localLog)
" FN)))))
#+END_SRC
Here ends the function =enc-make-stanza= that produces make-stanza for encoding.

The decoding is similar:
** Creating ~make~ stanza for decoding one file
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(dec-make-stanza(file-record)
(when-let ((XYZ (aref file-record cipher)) (FN (tilda (aref file-record plain))))
(let ((file-ext (file-name-extension FN)))
(concat
(if-let ((fstr (car (find file-ext specially-decoded :key #'cdr :test #'(lambda(x y) (member x y))))))
(format fstr FN XYZ (updated) (pass-d) XYZ)
(format "%s: $(cloud)%s.gpg
\t@$(dec) $@ $<
" FN XYZ ))
(format "\t-chgrp %s $@
\t-chmod %o $@
\t-touch --date=%S $@
\t-echo \"$(date): downloaded %s\" >> $(localLog)
" (aref file-record gname) (aref file-record modes) (full-TS (aref file-record mtime)) FN))))))
#+END_SRC

** Putting this all together
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun download (file-record)
(needs ((FN (aref file-record plain) (clog :error "download: file lacks plain name"))
        (stanza (dec-make-stanza file-record) (clog :error "download: could not create stanza for %s" FN)))
(push (format " %s" FN) all)
(push stanza Makefile) (NL)))
#+END_SRC

GNU make won't upload (with encryption) the file to the server if target is younger than the dependence.
=make-cloud-older= ensures that the ~.gpg~ file is old enough to prevent this behavior:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun make-cloud-older(file-record)
;;(clog :debug "make-cloud-older(%s)" (plain-name file-record))
(when-let ((clouded (get-file-properties (aref file-record cipher)))
           (local-mtime (aref file-record mtime)))
(when (time< local-mtime (aref clouded mtime))
(clog :debug "changing time stamp to %s" (FS (time-add local-mtime -60)))
  (set-file-times
(concat (remote-dir) (plain-name clouded) (cip-ext (plain-name file-record)))
(time-add local-mtime (- -60 (random 6000)))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun upload (file-record)
(needs ((FN (tilda (aref file-record plain)) (clog :error "upload: file lacks plain name"))
	(CN (aref file-record cipher) (clog :error "upload: file %s lacks cipher name" FN))
	(stanza (enc-make-stanza file-record) (clog :error "upload: could not create stanza for %s" FN)))
;;(clog :debug "started upload(%s)" FN)
(unless (member FN uploaded)
(push FN upload-queue)
;;(clog :debug "will indeed upload(%s)" FN)
(make-cloud-older file-record)
(push FN uploaded)
(push (format " %s" (concat (remote-dir) CN
(cip-ext FN)))
all)
(push stanza Makefile) (NL))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun reset-Makefile()
"reseting make file"
(when (or (and (file-exists-p (pass-d)) (file-directory-p (pass-d))) (safe-mkdir (pass-d)))
(setf all nil Makefile nil uploaded nil)
(inl "cloud=%s" remote-dir)
(inl "password=%S" password)
(inl "gpg=gpg --pinentry-mode loopback --batch --yes")
(inl "enc=$(gpg) --symmetric --passphrase $(password) -o")
(inl "dec=$(gpg) --decrypt   --passphrase $(password) -o")
(inl "localLog=%s" (local/log))
(inl "MK=%s" (cloud-mk))
(inl "date=`date '+%%m/%%d %%T'`
")
(inl (concat (format "%s: %s
\tawk '{print $$2 > %S$$1}' $<
\techo $(date) > $@
\t-chgrp -R tmp %s*
" (updated) (image-passes) (untilda (pass-d)) (pass-d))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun save-Makefile()
"flushing make file"
(inl "all:%s
\techo \"background (en/de)cryption on %s finished $(date)\" >> %s
\t@sed 's/%s/******/g' %s > %s.bak
"
(apply #'concat all)
(system-name)
(concat (remote-dir) "history")
password (cloud-mk) (cloud-mk))
(write-region (apply #'concat (reverse Makefile)) nil (cloud-mk))))))))
#+END_SRC

