cloud.org
* cloud-sync
=cloud-sync= is the most frequently used function.

We assume that files are changed only within emacs (either edited/saved or removed/renamed using ~dired~), so that
=file-DB= always contains the most recent information about clouded files.
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun cloud-sync()
(interactive)
(let ((ok t))
#+END_SRC
Even if the cloud was changed by some other hosts, information from =(local/all)= is still valuable (for resolving collissions)
and must be loaded at start (when =file-DB= is empty):
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(unless file-DB
 (clog :info "loading data from disk at start")
 (read-all (local/all)))
#+END_SRC
Now if we realize that clouded data is younger, we update the local one from it and =read-all= once again.
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(ifn (cloud-connected-p) (clog :warning "remote directory not mounted, so we will not encrypt %s-->%s" (local/all) (remote-files))
  (directory-lock (lock-dir)
    (when (file-newer-than-file-p (remote-files) (local/all))
      (clog :info "detected NEW %s, will now update %s from it" (remote-files) (local/all))
      (ifn (gpg-decrypt (local/all) (remote/files))
	(setf ok (clog :error "could not decrypt file data from the cloud; SHUT DOWN the service and INVESTIGATE!"))
	(unless (read-all (local/all))
	  (setf ok (clog :error "could not parse file data from the cloud; SHUT DOWN the service and INVESTIGATE!")))))
#+END_SRC

If our host made the last updates on the server, and we have some data to save, let us update =(local/all)=, and (if possible) =(remote-files)=:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(when (or added-files upload-queue removed-files)
  (ifn (write-all (local/all)) (setf ok (clog :error "could not save data to %s" (local/all)))
    (gpg-encrypt (local/all) (remote/files))
    (setf added-files nil upload-queue nil)))
#+END_SRC

It is always easier to read local file, so let me make it a little bit younger than the (encrypted) remote one:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(set-file-times (local/all) (current-time))
#+END_SRC
Now let us copy the files from/to the cloud:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(save-Makefile)
(let ((make (format "make -j%d -f %s all &> %s.log" N-CPU-cores (cloud-mk) (cloud-mk))))
  (clog :debug "starting %s" make)
  (shell-command make)
  (clog :debug "finished %s" make))
(reset-Makefile)))
#+END_SRC

Finally let us print stored messages (printed by =end-log=):
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(dolist (msg (reverse important-msgs)) (message msg))
(setf important-msgs nil)
(clog :info "done syncing")
(write-region (format "%s: %s -- %s
" (system-name)  (TS (current-time)) (format-time-string "%H:%M:%S" (current-time))) nil (concat (remote-dir) "history"))
ok))
#+END_SRC
=cloud-sync= ends here.

Let us =cloud-sync= before the user quits ~emacs~:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun before-exit()
;; (write-conf)
  (cloud-sync))
#+END_SRC
Note: if the connection with the cloud is unstable, an attempt to access the cloud can take more than 10 seconds.

So don't be surprised if quitting emacs takes a long time; the reason for that might be just broken connection to the cloud.
Let it wait for about 30 seconds, and it quits without syncing.
(The waiting time might depend on your [[ssh-config][ssh-configuration]].)

* Actions
By "action" I mean a pending order issued by another host.
For example, suppose that when I yesterday worked on my laptop, I have erased or renamed a file or a directory.
Today I came to my office and I want the same file/directory to be erased/renamed on my office computer.
Yesterday my laptop issued an order to erase/rename that file/directory on every host whoose name is
enumerated in =cloud-hosts=. This order will exist untill all hosts execute it, and then it will be forgotten.

** Definitions
Acctions can be applied to both files and directories. An action is a vector.
=(i-time i-ID i-args i-hostnames i-Nargs)= are integer indices, each pointing to a field in an action:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defvar action-fields '(i-time i-ID i-args i-hostnames i-Nargs))
(let ((i 0)) (dolist (AF action-fields) (setf i (1+ (set AF i)))))
#+END_SRC
where =i-Nargs= is used only when parsing action lines from the remote file DB.

=(i-forget i-delete i-rename i-host-add i-host-forget)= are integer IDs, each identifying some kind of action (e.g., "forget file/directory" or "delete file/directory"):
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defvar action-IDs '(i-forget i-delete i-rename i-host-add i-host-forget))
(let ((i 0)) (dolist (AI action-IDs) (setf i (1+ (set AI i)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun new-action (a-ID &rest args)
  (let ((action (make-vector (length action-fields) nil)))
    (aset action i-ID a-ID)
    (aset action i-time (current-time))
    (aset action i-args args)
    (aset action i-hostnames (remove (system-name) cloud-hosts))
    (push action remote-actions)))
#+END_SRC
Later more actions will be introduced:
1. =i-reset-pass= for (gradual – not for all files at once) password renewal
2. =i-reset-names= for gradual renaming of the files in the cloud.

The function =perform= performs an action:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun perform(action)
(write-region
(format "%s: %s
" (TS (current-time)) (format-action action))
nil (local/log) t)
  (let ((arguments (aref action i-args)))
    (case* (aref action i-ID) =
      (i-host-forget (dolist (arg arguments) (drop cloud-hosts arg)) t)
      (i-host-add (dolist (arg arguments) (push arg cloud-hosts)) t)
      (i-forget (cloud-forget-many arguments) t)
      (i-delete (cloud-rm arguments) t)
      (i-rename (cloud-rename-file (first arguments) (second arguments)) t)
      (otherwise (clog :error "unknown action %d" (aref action i-ID)))))
   (drop remote-actions action) t)
#+END_SRC

We must inform other hosts about actions they have to perform; for that we write list of actions
to the remote file DB using the function
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun format-action (action)
  (format "%S %d %d %s %s"
(full-TS (aref action i-time)); 1. Time stamp,
(aref action i-ID); 2. (integer) action ID,
(length (aref action i-args)); 3. (integer) number of arguments for this action (one column),
(apply #'concat (mapcar #'(lambda(arg) (format "%S " (tilda arg))) (aref action i-args))); 4. [arguments+] (several columns),
(apply #'concat (mapcar #'(lambda(HN) (format "%S " HN)) (aref action i-hostnames))))); 5. hostnames, where the action has to be performed (several columns).
#+END_SRC
In this block, every line is has the following fields (columns):
1. time stamp: in emacs'es single-thread world, time stamp can uniquely identify an action,
2. (integer) identifying action type,
3. (integer) number of arguments for this action (one column),
4. [arguments+] (several columns),
5. hostnames, where the action has to be performed (several columns).

Since there is no hook on renaming or deleting files, we overwrite dired functions for renaming and deleting;
their new versions will now contain standard code plus mine.

Storing standard definitions of =dired-rename-file= and =dired-delete-file= in variables ~DRF~ and ~DDF~:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(unless (boundp 'DRF) (defvar DRF (indirect-function (symbol-function 'dired-rename-file)) "original dired-rename-file function"))
(unless (boundp 'DDF) (defvar DDF (indirect-function (symbol-function 'dired-delete-file)) "original dired-delete-file function"))
#+END_SRC

Now let us write code for each of the following actions:
1. =delete= (created when a user removes a file or a directory in a dired buffer),
2. =cloud-host-add= (created when this code is launched on a computer, whose name is not mentioned in =cloud-hosts=,
3. =cloud-host-forget=,
4. =cloud-add=,
5. =cloud-forget=,
4. =cloud-rename= (called when the file/directory is renamed in ~dired~).

** Delete
We ovewrite standard emacs =dired-delete-file= function:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun dired-delete-file (FN &optional dirP TRASH)
  (let (failure (FN (tilda FN)))
#+END_SRC
Note that ~FN~ might be a directory.

IMHO, when ~FN~ is a directory, ~RECURSIVE~ (denoted by ~dirP~ here) must always be t!
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(condition-case err (funcall DDF FN dirP TRASH)
  (file-error
    (clog :error "in DDF: %s" (error-message-string err))
    (setf failure t)))
(unless failure
#+END_SRC
=file-DB= does *not* contain any directories, so if =FN= is a directory, the following block will do nothing:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(cloud-forget-recursive FN) (new-action i-delete FN)
(when dirP
  (dolist (sub-FN (mapcar #'plain-name (contained-in FN)))
    (when (cloud-forget-file sub-FN) (new-action i-delete sub-FN)))))))
#+END_SRC

The following function is used to perform pending delete ordered by another host:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun cloud-rm (args)
  (interactive) 
(let ((ok (cloud-forget-many args)))
  (dolist (arg args)
    (setf ok (and (safe-dired-delete arg) (cloud-forget-recursive arg) ok)))
ok))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun cloud-forget-many (args)
  (interactive) 
(let ((ok t))
  (dolist (arg args)
    (setf ok (and (cloud-forget-recursive arg) ok)))
ok))
#+END_SRC

When we rename or delete a folder, we have to perform similar action on every cloud file contained inside the folder.
The following function helps us finding such files:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun contained-in(dir-name); dir-name must end with a slash /
    (let (res)
      (dolist (DB-rec file-DB)
	(when(and
(< (length dir-name) (length (aref DB-rec plain)))
(string=(substring-no-properties (aref DB-rec plain) 0 (length dir-name)) dir-name))
	  (push DB-rec res)))
      res))
#+END_SRC

