cloud.org
** Add/forget hosts
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun add-to-actions(hostname)
  (dolist (action remote-actions)
    (unless (member hostname (aref action i-hostnames))
      (aset action i-hostnames (cons hostname (aref action i-hostnames))))))
(defun erase-from-actions(hostname)
  (dolist (action remote-actions)
    (when (member hostname (aref action i-hostnames))
      (aset action i-hostnames (remove hostname (aref action i-hostnames))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun cloud-host-add ()
  "adding THIS host to the cloud sync-system"
(let ((hostname (system-name)))
  (unless (member hostname cloud-hosts)
    (push hostname cloud-hosts))
  (new-action i-host-add hostname)
  (add-to-actions hostname)))
#+END_SRC
As of 2020-10-20 =cloud-host-forget= is untested:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun cloud-host-forget ()
  "remove host from the cloud sync-system"
  (let ((hostname (system-name)))
    (when (yes-or-no-p (format "Forget the host %s?" hostname))
      (new-action i-host-forget hostname)
      (if (cloud-sync)
	  (safe-dired-delete (local/config))
	(clog :error "sync failed, so I will not erase local configuration")))))
#+END_SRC
** Add files
To add (or "cloud") a file I suggest opening a dired buffer, mark the files and then =M-x cloud-add=:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun cloud-add (&optional FN)
  (interactive)
  (if (string= major-mode "dired-mode")
      (dired-map-over-marks (add-files (dired-get-filename)) nil)
    (unless
	(add-files (read-string "file to be clouded=" (if FN FN "")))
      (clog :error "could not cloud this file"))))
#+END_SRC
Pending upgrades for =cloud-add=:
1. =cloud-add= must become more user-friendly: let the user know that file(s) are sucessfully clouded, and
2. =cloud-add= must work with directories. This is, however, not so straightforward because I almost never want to cloud _all_ files within a directory.

#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun add-file(FN)
(let ((FN (tilda FN)))
(unless (cloud-locate-FN FN)
  (needs ((GFP (get-file-properties* (file-chase-links FN)) (clog :error "Aborting attempt to cloud inexisting file %s" FN))
          (CN (new-file-name remote-dir)))
(push FN added-files)
    (aset GFP cipher CN)
    (push GFP file-DB)
    (upload GFP)
    (when (member (file-name-extension FN) '("jpeg" "png" "jpg"))
#+END_SRC
← here we assumed that files' extensions are low case; this restriction can be easilly waived.

Since we are clouding an image, we need to 
1. generate an individual password for it,
2. save this password in the "all-passwords" file whose name is given by =(image-passes)=, and
3. notify our code that "all-passwords" file was changed:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(write-region
  (format "%s %s
" CN (rand-str 18)) nil (image-passes) t)
(touch (image-passes)))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun add-files(&rest names)
(when
  (dolist (FN names)
    (unless (cloud-locate-FN FN)
      (needs ((GFP (get-file-properties* (file-chase-links FN)) (clog :error "Aborting attempt to cloud inexisting file %s" FN))
              (CN (new-file-name remote-dir)))
	(aset GFP cipher CN)
	(push GFP file-DB)
	(when (member (file-name-extension FN) '("jpeg" "png" "jpg"))
#+END_SRC
← here we assumed that files' extensions are low case; this restriction can be easilly waived.

Since we are clouding an image, we need to 
1. generate an individual password for it,
2. save this password in the "all-passwords" file whose name is given by =(image-passes)=, and
3. notify our code that "all-passwords" file was changed:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(write-region
  (format "%s %s
" CN (rand-str 18)) nil (image-passes) t)
(touch (image-passes)))
(upload GFP))))
;;(save-Makefile)
ok))
#+END_SRC

** Forget files
#+END_SRC
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun cloud-forget-file (local-FN); called *after* the file has already been sucessfully deleted
   (push local-FN removed-files)
  (needs ((DB-rec (cloud-locate-FN local-FN) (clog :info "forget: doing nothing since %s is not clouded" local-FN))
          (CEXT (cip-ext local-FN))
	  (cloud-FN (concat (remote-dir) (aref DB-rec cipher) CEXT) (clog :error "in DB entry for %s" local-FN)))
#+END_SRC
Remove image's individual password:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(when (string= CEXT ".png")
(clog :debug "forgetting password for %s" local-FN)
  (forget-password (aref DB-rec cipher)))
#+END_SRC
Remove file from the database and erase its encrypted copy in the cloud:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(drop file-DB DB-rec)
(push local-FN removed-files)
(safe-dired-delete cloud-FN)
 t))
#+END_SRC
← returns t if the file was clouded; otherwise does nothing and returns nil.

=cloud-forget-recursive= should be called *after* the file has already been sucessfully deleted:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun cloud-forget-recursive(FN)
(dolist (sub-FN (mapcar #'plain-name (contained-in FN)))
(cloud-forget-file sub-FN)))
#+END_SRC

=cloud-forget= is excecuted either
1. when a file/directory is removed or
2. manually from the dired buffer
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun cloud-forget (&optional FN)
  (interactive)
  (if (string= major-mode "dired-mode")
      (dired-map-over-marks (cloud-forget-recursive (dired-get-filename)) nil)
    (unless
	(cloud-forget-recursive (read-string "file to be forgotten=" (if FN FN "")))
      (clog :error "could not forget this file"))))
#+END_SRC

** Rename
=cloud-rename-file= updates the file data base *after* the file has already been sucessfully renamed:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun cloud-rename-file (old new)
  (let ((source (cloud-locate-FN old))
        (target (cloud-locate-FN new)))
(cloud-forget-recursive old)
    (cond
     ((and source target); overwriting one cloud file with another one
      (dolist (property (list mtime modes uname gname)) do
            (aset target property (aref source property)))
      (drop file-DB source))
     (source (aset source plain new))
     (target (setf target (get-file-properties* new))))))
#+END_SRC

Updating =dired-rename-file= by overwriting it:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun dired-rename-file (old-FN new-FN ok-if-already-exists)
  (let (failure)
    (clog :debug "DRF")
    (condition-case err
	(funcall DRF old-FN new-FN ok-if-already-exists)
      (file-error
       (clog :debug "DRF error!")
       (message "%s" (error-message-string err))
       (setf failure t)))
    (unless failure
      (clog :debug "launching my cloud rename %s --> %s" old-FN new-FN)
      (cloud-rename-file old-FN new-FN)
      (new-action i-rename old-FN new-FN))))
#+END_SRC

* Starting all this machinery
** Every time we start ~emacs~
I suggest running =(cloud-start)= from =~/.emacs= every time you restart ~emacs~ (see [[file:README.org::Quick start][README.org]]):
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun cloud-start()
  (interactive) (save-some-buffers)
(clog :debug "cloud-start: local/config = %s" (local/config))
(ifn-let ((conf (read-conf)))
(progn
  (clog :warning "could not read local configuration file, trying to (re)create configuration")
  (when (cloud-init)
  (clog :info "check newly created configuraion %s and then M-x cloud-start" (local/config))))
#+END_SRC
We have read configuration, and now let us check if it is correct:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(ifn (and
   (if-let ((CD (cdr (assoc "remote-directory" conf))))
	  (setf remote-dir CD)
	(setf remote-dir (read-string "cloud directory=" remote-dir))
	(write-conf) t)
   (setf remote/files (cdr (assoc "remote/files" conf)))
   (setf N-CPU-cores (string-to-number (or (cdr (assoc "number-of-CPU-cores" conf)) "1")))
   (setf password  (cdr (assoc "password" conf))))
(clog :error "something is missing or wrong in the configuration file" remote-dir)
#+END_SRC
In case ~remote-directory~ configuration parameter is missing, let ask the user for the input:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(setf remote-dir 
  (or (cdr (assoc "remote-directory" conf))
      (read-string "cloud directory=" remote-dir)))
#+END_SRC
At this point the configuration is o.k., so we can save it when we quit eamcs:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(add-hook 'kill-emacs-hook 'before-exit)
#+END_SRC
The file with the name given by =(image-passes)= contains individual passwords used to encode images;
even if we've got no images clouded so there are no passwords for them, this file should still exist:
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(unless (file-exists-p (image-passes))
  (write-region "" nil (image-passes))
  (add-files (image-passes)))
#+END_SRC
← and it must also be clouded.
#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(reset-Makefile)
(cloud-sync))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/main.el
(defun read-fileDB()
(clog :debug "starting read-fileDB")
(or
(and
;; (cloud-connected-p)
(= 0 (apply #'call-process
(append (list "gpg" nil nil nil)
(split-string (format
"--batch --yes --pinentry-mode loopback --passphrase %s -o %s --decrypt %s"
#+END_SRC
← Strange: there will be errors if I quote password by writing =--passphrase %S= instead of =--passphrase %s=!

#+BEGIN_SRC emacs-lisp :tangle generated/main.el
password (untilda (local/all)) (remote-files))))))
(read-all (local/all)))
(clog :error "cloud-start header failed") nil))
#+END_SRC

* In case of emergency
Saving database to a file:
#+BEGIN_SRC 
(defun write-fileDB-full (DBname)
  (with-temp-file DBname
    (dolist (file-record file-DB)
          (progn (insert (format-file file-record)) (newline)))))
(write-fileDB-full "/home/shalaev/cloud.db")
#+END_SRC

